<?php
$doc_head = $CURR_PID."_".$CURR_YEAR."_";
$now = time(0);
$time1 = $now;
$month = date("m");
if($month>8) $time2 = strtotime((date(Y)+1)."-06-05 23:59:59");
else if($month<2) $time2 = strtotime(date(Y)."-06-05 23:59:59");
else $time2 = strtotime(date(Y)."-06-05 23:59:59");
if($month>8) $time3 = strtotime((date(Y)+1)."-06-15 23:59:59");
else if($month<2) $time3 = strtotime(date(Y)."-06-15 23:59:59");
else $time3 = strtotime(date(Y)."-06-15 23:59:59");

$sql = "INSERT INTO `".$TABLE."mission_list` (`name`, `address`, `filename1`, `filename2`, `uploader`, `demonstration`, `start_time`, `end_time`, `print_time`, `paper_type`, `paper_num`, `year`, `pro_id`, `lockit`, `needdoc`) VALUES
('选题表', '".$doc_head."XuanTiBiao', '', '', 1, '本文档由教师撰写和上传，请通过本文档说明本毕业设计的设计意义和系统要求。具体格式请参考学校的毕业设计（论文）规范文件。', ".($time1++).", $time2, $time3, 'A4', 1, '$CURR_YEAR', $CURR_PID, 2, 1),
('任务书', '".$doc_head."RenWuShu', '', '', 1, '本文档由教师撰写和上传，请通过本文档说明对本毕业设计进行详细的任务安排。具体格式请参考学校的毕业设计（论文）规范文件。请注意，纯论文的设计版式与常规版式和具体要求有差异，请按照课题类型给不同的课题提交不同的任务书。', ".($time1++).", $time2, $time3, 'A4', 1, '$CURR_YEAR', $CURR_PID, 2, 1),
('开题报告', '".$doc_head."KaiTiBaoGao', '', '', 0, '本文档由学生撰写和上传，请通过本文档说明你在接收本设计题目后，对本课题做的调研情况、实现方法的研究情况、对课题重点难点的理解情况以及你准备实现的具体成果进行表述。\r\n具体格式请参考学校的毕业设计（论文）规范文件，请注意，研究类毕业论文的开题报告与工程设计类开题报告的格式和栏目设置不同，请严格按照合适的开题报告栏目撰写相关信息。若有不懂，请向你的指导老师请教。', ".($time1++).", $time2, $time3, 'A4', 1, '$CURR_YEAR', $CURR_PID, 2, 1),
('译文－外文原文', '".$doc_head."YiWenYuanWen', '', '', 1, '根据学校毕业设计工作要求，每位本科毕业生必须在毕业设计期间完成一篇外文参考文献的全文翻译工作（3000字以上）。外文资料一般指在正规期刊或会议上发表的论文；或产品的外文参考资料文档。\r\n\r\n<font color=red><b>【由教师提交】</b></font>请指导老师根据毕业设计具体内容，确定一篇合适的外文资料，在此提交给学生。', ".($time1++).", $time2, $time3, 'A4', 1, '$CURR_YEAR', $CURR_PID, 2, 1),
('译文－中文翻译', '".$doc_head."YiWenZhongWen', '', '', 0, '根据学校毕业设计工作要求，每位本科毕业生必须在毕业设计期间完成一篇外文参考文献的全文翻译工作（3000字以上）。外文资料一般指在正规期刊或会议上发表的论文；或产品的外文参考资料文档。\r\n\r\n<font color=red><b>【由学生翻译后提交】</b></font>请下载指导老师提交的“译文―外文原文”，并将此文章翻译为中文。请注意译文的格式要与原文尽量保持一致。', ".($time1++).", $time2, $time3, 'A4', 1, '$CURR_YEAR', $CURR_PID, 2, 1),
('中期抽查表', '".$doc_head."ZhongQiChouChaBiao', '', '', 1, '请各位指导老师按照“中期抽查表”对自己的学生进行抽查，一般而言，抽查学生应占自己指导学生人数的四分之一。抽查后请填写本抽查表，并上传到被抽查的学生名下，以便汇总。', ".($time1++).", $time2, $time3, 'A4', 1, '$CURR_YEAR', $CURR_PID, 2, 0),
('毕业论文－初稿', '".$doc_head."LunWenChuGao', '', '', 0, '本文档由学生撰写和上传，几点需要特别注意的问题：\r\n1、课题类型为“科学研究”的，撰写毕业论文，其余同学撰写“毕业设计说明书”；\r\n2、毕业设计说明书不少于2万字，毕业论文不少于1.2万字\r\n3、写法、格式、要求等信息学校有具体要求和规范，请务必仔细阅读参考文档。\r\n具体格式请参考学校的毕业设计（论文）规范文件。若有不懂，请向你的指导老师请教。\r\n\r\n【特别注意】论文初稿要求在5月10日前提交给指导老师审阅。未提交论文者将不会自动进入论文送评和答辩分组阶段。同时也请指导老师督促学生按时完成初稿。', ".($time1++).", $time2, $time3, 'A4', 1, '$CURR_YEAR', $CURR_PID, 2, 1),
('软硬件验收表', '".$doc_head."YanShouBiao', '', '', 1, '根据我系规定，要求学生毕业设计必须完成成品（包括硬件实物、软件、网站）。根据学校规定，成品需验收。\r\n成品功能描述由学生向指导教师提供，指导教师根据学生提供的功能描述对学生设计的成品进行验收，并把学生提交的功能和教师验收的结果形成文字表格，由指导教师提交到网站中。\r\n部分未能完成成品的情况，请如实填写，谢谢。', ".($time1++).", $time2, $time3, 'A4', 1, '$CURR_YEAR', $CURR_PID, 2, 0),
('答辩用幻灯片', '".$doc_head."PPT', '', '', 0, '小组答辩时间由所在答辩小组落实，具体安排请等候系统通知。通常，答辩小组有30～40名学生，6名教师组成。答辩过程：答辩演讲10分钟以内；设计成果演示10分钟以内；答辩教师提问5个问题左右（不限）。答辩需采用幻灯片汇报的形式进行，请在此处提交你的汇报PPT文件。', ".($time1++).", $time2, $time3, 'A4', 1, '$CURR_YEAR', $CURR_PID, 2, 1),
('毕业论文－终稿', '".$doc_head."LunWenZhongGao', '', '', 0, '【注意】本处仅用于提交论文定稿。\r\n一般情况下，答辩前的论文请提交到“毕业论文－初稿”中；毕业答辩后，请根据答辩老师、评阅老师和指导老师的要求，全面修订毕业论文，并交给指导老师审核。\r\n请确保你修改的论文得到了指导老师确认，形成终稿，并将终稿上传到本处。', ".($time1++).", $time2, $time3, 'A4', 1, '$CURR_YEAR', $CURR_PID, 2, 1),
('毕业设计材料', '".$doc_head."SheJiCaiLiao', '', '', 0, '请把你毕业设计中形成的材料上传到本处，包括以下内容：\r\n 1、硬件设计的图纸电子文件\r\n 2、硬件设计的完整工程文件源代码\r\n 3、硬件设计的成品功能说明、接线方法和操作说明\r\n 4、软件设计的完整工程文件源代码\r\n 5、软件设计的软件功能说明、安装方法和操作说明\r\n 6、网站设计的网站支撑平台安装说明文件\r\n 7、网站设计的网站源代码及其数据库导入文件\r\n 8、网站设计的网站功能说明、安装方法和操作说明\r\n 9、其他设计的相关数据、图表\r\n【注意】所有文档【打包】上传。【切记】不要上传开发环境软件（比如Keil、仿真软件、VC、Dreamware等不是你自己的软件）。\r\n【只上传你自己的文档！】', ".($time1++).", $time2, $time3, 'A4', 1, '$CURR_YEAR', $CURR_PID, 2, 0),
('答辩记录', '".$doc_head."DaBianJiLu', '', '', 0, '答辩记录是非常重要的留档文件，请各位同学在答辩前，自己找到一位同学（最好在同一个答辩小组的同学）帮你记录答辩中老师的提问和你的回答问题的情况。该文件要形成一个Word文档，在此处上传。\r\n通常，需要记录5个以上的问题和回答。', ".($time1++).", $time2, $time3, 'A4', 1, '$CURR_YEAR', $CURR_PID, 2, 0),
('指导记录', '".$doc_head."ZhiDaoJiLu', '', '', 1, '根据学校要求，每位老师需将自己的指导情况记录下来，形成指导记录文件。请各位指导老师以学生为单位，逐一提交指导记录，谢谢。', ".($time1++).", $time2, $time3, 'A4', 1, '$CURR_YEAR', $CURR_PID, 2, 0);";
?>